Revit 2015 API
TableSectionData.SetCellFormatOptions Method
 Sets a cell's FormatOptions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
public void SetCellFormatOptions(
	int nRow,
	int nCol,
	FormatOptions options
)
Visual Basic
Public Sub SetCellFormatOptions ( _
	nRow As Integer, _
	nCol As Integer, _
	options As FormatOptions _
)
Visual C++
public:
void SetCellFormatOptions(
	int nRow,
	int nCol,
	FormatOptions^ options
)
Parameters
nRow
Type: System.Int32
 The row index of the cell
nCol
Type: System.Int32
 The column index of the cell
options
Type: Autodesk.Revit.DB.FormatOptions
 The format option to assign
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given row number nRow is invalid. -or- The given column number nCol is invalid. -or- The display unit in options is not a valid display unit for the unit type of the cell. See UnitUtils.IsValidDisplayUnit(UnitType, DisplayUnitType) and UnitUtils.GetValidDisplayUnits(UnitType).
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
TableSectionData Class
Autodesk.Revit.DB Namespace